export interface Album {
  id: string;
  title: string;
  photos: string[];
}

export const albums: Album[] = [
  {
    id: 'album-6',
    title: '20260417－學生吳貞昀、黃晟偉榮獲中研院暑期實習機會',
    photos: [
      '中研院實習錄取通知.png',
      '確認信_晟偉.png',
      '確認信_貞昀.png',
    ],
  },
  {
    id: 'album-1',
    title: '20251122－學生陳冠廷、吳貞昀、黃晟偉晉級「2025中興大學AI賦能與機器人於智慧製造應用專題實作競賽」決賽',
    photos: [
      '20251122_133137.jpg',
      '20251122_133358.jpg',
      '20251122_133518.jpg',
      '20251122_133544.jpg',
      '20251122_133633.jpg',
      '20251122_133634.jpg',
      '20251122_133720.jpg',
      '20251122_133838.jpg',
      '20251122_133909.jpg',
      '20251122_134020.jpg',
      '20251122_134330.jpg',
    ],
  },
  {
    id: 'album-2',
    title: '20251108－參加CACS研討會',
    photos: [
      '20251108_103739.jpg',
      '20251108_103901.jpg',
      '20251108_111624.jpg',
      '20251108_111628.jpg',
      '20251108_111633.jpg',
    ],
  },
  {
    id: 'album-3',
    title: '20251106－指導學生黃晟偉、陳冠廷、吳貞昀、史其恩獲得「114 年精密工程專題與論文獎」大專專題獎－銀獎',
    photos: [
      '20251106_092834.jpg',
      '20251106_092904.jpg',
      '20251106_130023.jpg',
      '20251106_130036.jpg',
      '20251106_130047.jpg',
      '20251106_130059.jpg',
      '20251106_130124.jpg',
      '20251106_180510.jpg',
      'PDA06083.JPG_compressed (1).JPEG',
      'PDA06087.JPG_compressed (1).JPEG',
      'PDA06092.JPG_compressed.JPEG',
    ],
  },
  {
    id: 'album-4',
    title: '202407－參加AMLDS研討會',
    photos: [
      '1752991397272.jpg',
      '20250719_094704.jpg',
      '20250719_190128.jpg',
      '20250719_192945.jpg',
      '20250720_115851.jpg',
      '20250720_120101.jpg',
      '20250720_120146.jpg',
    ],
  },
  {
    id: 'album-5',
    title: '202307－參加AIVR研討會',
    photos: [
      '1721399268758.jpg',
      '1721399279359.jpg',
      '20240718_162317.jpg',
      '20240718_163057.jpg',
      '20240718_170217.jpg',
      '20240718_195754.jpg',
      '20240719_162151.jpg',
      '20240720_094853.jpg',
      '20240720_094937.jpg',
      '20240720_130202.jpg',
      '20240721_132006.jpg',
      '20240721_133013.jpg',
      '20240721_133336.jpg',
      '20240721_133518.jpg',
      '20240721_140733.jpg',
      '20240721_215353.jpg',
    ],
  },
];
